////////////////////////////////////////////////////////////////////////////////
// Данный файл содержит макросы для проверки на ошибку при вызове функции
// POSIX Threads. Значение возвращаемое функцией сравнивается с 0 (нет ошибок),
// дальнейшие поведение определяется конкретным макросом
////////////////////////////////////////////////////////////////////////////////

// Если вызов функции завершился с ошибкой, вывести сообщение об ошибке
#define POSIX_CHECK(call)                                                      \
{                                                                              \
	int __error__ = call;                                                      \
	if (__error__ != 0)                                                        \
		printf("%s failed with error (%d)\n", #call, __error__);               \
}

// Если вызов функции завершился с ошибкой, вывести сообщение об ошибке
// и завершить работу программы
#define POSIX_CHECK_EXIT(call)                                                 \
{                                                                              \
	int __error__ = call;                                                      \
	if (__error__ != 0)                                                        \
	{                                                                          \
		printf("%s failed with error (%d)\n", #call, __error__);               \
		exit(-1);                                                              \
	}                                                                          \
}
